{
  "<|assistant|>": 50278,
  "<|audio_end|>": 50264,
  "<|audio_start|>": 50263,
  "<|code_end|>": 50268,
  "<|code_start|>": 50267,
  "<|image_end|>": 50262,
  "<|image_start|>": 50261,
  "<|knowledge|>": 50276,
  "<|math_end|>": 50270,
  "<|math_start|>": 50269,
  "<|mm_placeholder|>": 50280,
  "<|pad|>": 50257,
  "<|reasoning_end|>": 50272,
  "<|reasoning_start|>": 50271,
  "<|sep|>": 50260,
  "<|startoftext|>": 50259,
  "<|system|>": 50279,
  "<|teaching|>": 50275,
  "<|thinking_end|>": 50274,
  "<|thinking_start|>": 50273,
  "<|unk|>": 50258,
  "<|user|>": 50277,
  "<|video_end|>": 50266,
  "<|video_start|>": 50265
}
